Masmiseim36/nxpSDK/boards/evkmimxrt1010/demo_apps/safety_iec60730b/pin_mux.h
/*
 * Copyright 2021 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_09 (number 3), LPUART1_RXD/J56[2] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                      RXD   /*!< Signal name */

/* GPIO_10 (number 2), LPUART1_TXD/J56[4] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                      TXD   /*!< Signal name */

/* GPIO_AD_01 (number 59), ADC12_1/J26[10]/J56[14] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC12_1_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC12_1_SIGNAL                                 gpiomux_io   /*!< Signal name */
#define BOARD_INITPINS_ADC12_1_CHANNEL                                       15U   /*!< Signal channel */

/* GPIO_AD_02 (number 58), ADC12_2/J26[12]/J56[16] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC12_2_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC12_2_SIGNAL                                 gpiomux_io   /*!< Signal name */
#define BOARD_INITPINS_ADC12_2_CHANNEL                                       16U   /*!< Signal channel */

/* GPIO_AD_07 (number 51), ADC12_3/J26[2] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC12_3_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC12_3_SIGNAL                                         IN   /*!< Signal name */
#define BOARD_INITPINS_ADC12_3_CHANNEL                                        7U   /*!< Signal channel */

/* GPIO_AD_10 (number 47), ADC12_5/JTAG_TDI/J55[8]/J26[6] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC12_5_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_ADC12_5_SIGNAL                                         IN   /*!< Signal name */
#define BOARD_INITPINS_ADC12_5_CHANNEL                                       10U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
